redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_1nd/redis_result_Gauss82_F_OFF_P1_1nd20230717183522.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6497.35          ---          ---         3.09676         2.95900         6.01500         6.87900      6979.39 
Gets        25979.67     25979.67         0.00         3.06971         2.95900         6.01500         6.84700     27780.21 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      32477.02     25979.67         0.00         3.07513         2.95900         6.01500         6.87900     34759.59 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.207        0.000
SET       2.671        5.000
SET       2.735       10.000
SET       2.767       15.000
SET       2.799       20.000
SET       2.831       25.000
SET       2.863       30.000
SET       2.895       35.000
SET       2.911       40.000
SET       2.943       45.000
SET       2.959       50.000
SET       2.975       52.500
SET       2.991       55.000
SET       3.007       57.500
SET       3.007       60.000
SET       3.023       62.500
SET       3.039       65.000
SET       3.055       67.500
SET       3.071       70.000
SET       3.087       72.500
SET       3.103       75.000
SET       3.119       76.250
SET       3.119       77.500
SET       3.135       78.750
SET       3.151       80.000
SET       3.167       81.250
SET       3.183       82.500
SET       3.199       83.750
SET       3.215       85.000
SET       3.231       86.250
SET       3.263       87.500
SET       3.279       88.125
SET       3.295       88.750
SET       3.311       89.375
SET       3.327       90.000
SET       3.343       90.625
SET       3.359       91.250
SET       3.391       91.875
SET       3.423       92.500
SET       3.471       93.125
SET       3.535       93.750
SET       3.599       94.062
SET       3.743       94.375
SET       3.983       94.688
SET       4.127       95.000
SET       4.255       95.312
SET       4.351       95.625
SET       4.415       95.938
SET       4.543       96.250
SET       4.703       96.562
SET       5.279       96.875
SET       5.407       97.031
SET       5.471       97.188
SET       5.535       97.344
SET       5.599       97.500
SET       5.631       97.656
SET       5.695       97.812
SET       5.727       97.969
SET       5.791       98.125
SET       5.823       98.281
SET       5.855       98.438
SET       5.887       98.516
SET       5.919       98.594
SET       5.919       98.672
SET       5.951       98.750
SET       5.983       98.828
SET       5.983       98.906
SET       6.015       98.984
SET       6.047       99.062
SET       6.047       99.141
SET       6.079       99.219
SET       6.111       99.258
SET       6.111       99.297
SET       6.143       99.336
SET       6.175       99.375
SET       6.175       99.414
SET       6.207       99.453
SET       6.239       99.492
SET       6.271       99.531
SET       6.303       99.570
SET       6.335       99.609
SET       6.367       99.629
SET       6.367       99.648
SET       6.399       99.668
SET       6.431       99.688
SET       6.463       99.707
SET       6.463       99.727
SET       6.495       99.746
SET       6.527       99.766
SET       6.559       99.785
SET       6.591       99.805
SET       6.623       99.814
SET       6.623       99.824
SET       6.655       99.834
SET       6.687       99.844
SET       6.719       99.854
SET       6.751       99.863
SET       6.783       99.873
SET       6.815       99.883
SET       6.847       99.893
SET       6.911       99.902
SET       6.975       99.907
SET       7.007       99.912
SET       7.071       99.917
SET       7.103       99.922
SET       7.167       99.927
SET       7.295       99.932
SET       7.391       99.937
SET       7.615       99.941
SET       7.935       99.946
SET       8.063       99.951
SET       8.191       99.954
SET       8.255       99.956
SET       8.511       99.958
SET       8.639       99.961
SET       8.895       99.963
SET       8.959       99.966
SET       9.535       99.968
SET       9.791       99.971
SET      10.047       99.973
SET      10.559       99.976
SET      11.327       99.977
SET      11.647       99.978
SET      12.031       99.979
SET      12.159       99.980
SET      13.183       99.982
SET      13.695       99.983
SET      13.823       99.984
SET      14.079       99.985
SET      16.255       99.987
SET      16.767       99.988
SET      16.895       99.988
SET     169.983       99.989
SET     169.983       99.990
SET     169.983       99.990
SET     169.983       99.991
SET     169.983       99.991
SET     169.983       99.992
SET     169.983       99.993
SET     169.983       99.993
SET     169.983       99.994
SET     169.983       99.994
SET     169.983       99.995
SET     169.983       99.995
SET     169.983       99.995
[...]
SET     169.983       99.996
SET     169.983       99.996
SET     169.983       99.996
SET     169.983       99.997
SET     171.007       99.997
SET     171.007       99.997
SET     171.007       99.997
[...]
SET     171.007       99.998
SET     171.007       99.998
SET     171.007       99.998
[...]
SET     171.007       99.999
SET     171.007       99.999
SET     171.007       99.999
[...]
SET     173.055       99.999
SET     173.055       99.999
SET     173.055       99.999
[...]
SET     173.055      100.000
SET     173.055      100.000
SET     173.055      100.000
SET     175.103      100.000
SET     175.103      100.000
---
GET       0.223        0.000
GET       2.671        5.000
GET       2.719       10.000
GET       2.767       15.000
GET       2.799       20.000
GET       2.831       25.000
GET       2.847       30.000
GET       2.879       35.000
GET       2.911       40.000
GET       2.927       45.000
GET       2.959       50.000
GET       2.959       52.500
GET       2.975       55.000
GET       2.991       57.500
GET       2.991       60.000
GET       3.007       62.500
GET       3.023       65.000
GET       3.039       67.500
GET       3.055       70.000
GET       3.071       72.500
GET       3.087       75.000
GET       3.087       76.250
GET       3.103       77.500
GET       3.119       78.750
GET       3.119       80.000
GET       3.135       81.250
GET       3.151       82.500
GET       3.167       83.750
GET       3.183       85.000
GET       3.215       86.250
GET       3.231       87.500
GET       3.247       88.125
GET       3.263       88.750
GET       3.279       89.375
GET       3.295       90.000
GET       3.311       90.625
GET       3.327       91.250
GET       3.359       91.875
GET       3.391       92.500
GET       3.423       93.125
GET       3.471       93.750
GET       3.503       94.062
GET       3.551       94.375
GET       3.647       94.688
GET       3.887       95.000
GET       4.095       95.312
GET       4.223       95.625
GET       4.351       95.938
GET       4.447       96.250
GET       4.575       96.562
GET       4.895       96.875
GET       5.279       97.031
GET       5.407       97.188
GET       5.471       97.344
GET       5.535       97.500
GET       5.599       97.656
GET       5.663       97.812
GET       5.695       97.969
GET       5.759       98.125
GET       5.791       98.281
GET       5.855       98.438
GET       5.855       98.516
GET       5.887       98.594
GET       5.919       98.672
GET       5.919       98.750
GET       5.951       98.828
GET       5.983       98.906
GET       5.983       98.984
GET       6.015       99.062
GET       6.047       99.141
GET       6.079       99.219
GET       6.079       99.258
GET       6.111       99.297
GET       6.111       99.336
GET       6.143       99.375
GET       6.143       99.414
GET       6.175       99.453
GET       6.207       99.492
GET       6.239       99.531
GET       6.271       99.570
GET       6.303       99.609
GET       6.303       99.629
GET       6.335       99.648
GET       6.367       99.668
GET       6.367       99.688
GET       6.399       99.707
GET       6.431       99.727
GET       6.463       99.746
GET       6.495       99.766
GET       6.527       99.785
GET       6.559       99.805
GET       6.591       99.814
GET       6.623       99.824
GET       6.623       99.834
GET       6.655       99.844
GET       6.687       99.854
GET       6.719       99.863
GET       6.751       99.873
GET       6.783       99.883
GET       6.815       99.893
GET       6.879       99.902
GET       6.911       99.907
GET       6.943       99.912
GET       6.975       99.917
GET       7.039       99.922
GET       7.103       99.927
GET       7.167       99.932
GET       7.263       99.937
GET       7.359       99.941
GET       7.583       99.946
GET       7.903       99.951
GET       7.999       99.954
GET       8.127       99.956
GET       8.319       99.958
GET       8.447       99.961
GET       8.639       99.963
GET       8.767       99.966
GET       9.023       99.968
GET       9.407       99.971
GET       9.919       99.973
GET      10.111       99.976
GET      10.175       99.977
GET      10.431       99.978
GET      10.751       99.979
GET      11.007       99.980
GET      11.199       99.982
GET      11.455       99.983
GET      11.711       99.984
GET      12.031       99.985
GET      12.223       99.987
GET      13.055       99.988
GET      13.247       99.988
GET      13.567       99.989
GET      13.759       99.990
GET      13.887       99.990
GET      14.143       99.991
GET      14.463       99.991
GET      14.911       99.992
GET      16.511       99.993
GET     169.983       99.993
GET     169.983       99.994
GET     169.983       99.994
GET     169.983       99.995
GET     169.983       99.995
GET     169.983       99.995
[...]
GET     169.983       99.996
GET     169.983       99.996
GET     169.983       99.996
GET     169.983       99.997
GET     169.983       99.997
GET     169.983       99.997
[...]
GET     169.983       99.998
GET     169.983       99.998
GET     169.983       99.998
[...]
GET     171.007       99.998
GET     171.007       99.998
GET     171.007       99.998
GET     171.007       99.999
GET     171.007       99.999
GET     171.007       99.999
[...]
GET     171.007      100.000
GET     173.055      100.000
GET     173.055      100.000
GET     175.103      100.000
GET     175.103      100.000
GET     175.103      100.000
[...]
GET     176.127      100.000
GET     176.127      100.000
---
WAIT      0.000      100.000